lkolbly/cmsis-svd/data/Atmel/ATSAML21J16A.svd
        <register derivedFrom="PINCFG0_%s">
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PINCFG1_%s</name>
          <description>Pin Configuration n - Group 1</description>
          <addressOffset>0xc0</addressOffset>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PMUX0_%s</name>
          <description>Peripheral Multiplexing n - Group 0</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PMUXE</name>
              <description>Peripheral Multiplexing for Even-Numbered Pin</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PMUXO</name>
              <description>Peripheral Multiplexing for Odd-Numbered Pin</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register derivedFrom="PMUX0_%s">
          <dim>16</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PMUX1_%s</name>
          <description>Peripheral Multiplexing n - Group 1</description>
          <addressOffset>0xb0</addressOffset>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>WRCONFIG%s</name>
          <description>Write Configuration</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PINMASK</name>
              <description>Pin Mask for Multiple Pin Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>PMUXEN</name>
              <description>Select Peripheral Multiplexer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INEN</name>
              <description>Input Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PULLEN</name>
              <description>Pull Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DRVSTR</name>
              <description>Output Driver Strength Selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PMUX</name>
              <description>Peripheral Multiplexing Template</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WRPMUX</name>
              <description>Write PMUX Registers</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRPINCFG</name>
              <description>Write PINCFG Registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HWSEL</name>
              <description>Half-Word Select</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RSTC</name>
      <version>1.1.0</version>
      <description>Reset Controller</description>
      <groupName>RSTC</groupName>
      <prependToName>RSTC_</prependToName>
      <baseAddress>0x40000800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BKUPEXIT</name>
          <description>Backup Exit Source</description>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EXTWAKE</name>
              <description>External Wakeup</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTC</name>
              <description>Real Timer Counter Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BBPS</name>
              <description>Battery Backup Power Switch</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCAUSE</name>
          <description>Reset Cause</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>POR</name>
              <description>Power On Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD12</name>
              <description>Brown Out 12 Detector Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD33</name>
              <description>Brown Out 33 Detector Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXT</name>
              <description>External Reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDT</name>
              <description>Watchdog Reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYST</name>
              <description>System Reset Request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BACKUP</name>
              <description>Backup Reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WKCAUSE</name>
          <description>Wakeup Cause</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>WKCAUSE</name>
              <description>Wakeup Cause</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKDBCONF</name>
          <description>Wakeup Debounce Configuration</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>WKDBCNT</name>
              <description>Wakeup Debounce Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>WKDBCNTSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No debouncing.Input pin is low or high level sensitive depending on its WKPOLx bit.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2CK32</name>
                  <description>Input pin shall be active for at least two 32kHz clock period.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3CK32</name>
                  <description>Input pin shall be active for at least three 32kHz clock period.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CK32</name>
                  <description>Input pin shall be active for at least 32 32kHz clock period.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512CK32</name>
                  <description>Input pin shall be active for at least 512 32kHz clock period.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4096CK32</name>
                  <description>Input pin shall be active for at least 4096 32kHz clock period.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32768CK32</name>
                  <description>Input pin shall be active for at least 32768 32kHz clock period.</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WKEN</name>
          <description>Wakeup Enable</description>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>WKEN</name>
              <description>Wakeup Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WKPOL</name>
          <description>Wakeup Polarity</description>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>WKPOL</name>
              <description>Wakeup Polarity</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
